In [1]:
# Grouping in Pandas

In [2]:
import pandas as pd

In [3]:
data = pd.read_csv("/home/thulasiram/personal/my_data_science_journey/personal/ads_pii.csv")

In [14]:
data.employee_id.nunique()

3711

In [20]:
data.head(3)

,employee_id,manager,driver,question,still_in_company,answer
0,922249,Mary,My Team,Do you have a best friend at work?,1,Yes
1,554242,Anna,My Team,Do you feel that your team contributes to your...,1,"Yes, absolutely!"
2,679867,Emma,My Team,Do you have a best friend at work?,1,Yes

In [21]:
data_deduplicated = data.drop_duplicates(subset=['employee_id','manager'],keep='last')

In [39]:
data_deduplicated.manager.nunique()

815

In [41]:
data_deduplicated[data_deduplicated['still_in_company'] == 0].manager.value_counts()

Missouri    17
Antonia      9
Sophia       8
Regina       8
Rhoda        8
            ..
Annetta      1
Jean         1
Salome       1
Drusilla     1
Polly        1
Name: manager, Length: 531, dtype: int64

In [25]:
grouped = data_deduplicated.groupby(['manager','still_in_company'])['employee_id'].agg(['count'])

In [26]:
grouped

                          count
manager still_in_company
Abbie   0                     3
        1                     6
Abby    0                     3
        1                     2
Abigail 1                     2
...                         ...
Zona    1                     2
Zora    0                     2
        1                     1
Zula    0                     2
        1                     4

[1218 rows x 1 columns]

In [35]:
grouped_unstack = grouped.unstack(-1).reset_index()

In [36]:
grouped_unstack

                  manager count
still_in_company              0    1
0                   Abbie   3.0  6.0
1                    Abby   3.0  2.0
2                 Abigail   NaN  2.0
3                     Ada   1.0  1.0
4                    Adah   NaN  6.0
..                    ...   ...  ...
810                   Zoe   1.0  7.0
811                  Zola   NaN  1.0
812                  Zona   NaN  2.0
813                  Zora   2.0  1.0
814                  Zula   2.0  4.0

[815 rows x 3 columns]

In [37]:
grouped_unstack.columns = ['manager','in_company','left_company']

In [46]:
grouped_unstack.fillna(0,inplace=True)
grouped_unstack['total'] = grouped_unstack['left_company'] + grouped_unstack['in_company']
grouped_unstack['proportion'] = round(grouped_unstack['left_company'] / grouped_unstack['total']*100,2)

In [47]:
grouped_unstack

     manager  in_company  left_company  total  proportion
0      Abbie         3.0           6.0    9.0       66.67
1       Abby         3.0           2.0    5.0       40.00
2    Abigail         0.0           2.0    2.0      100.00
3        Ada         1.0           1.0    2.0       50.00
4       Adah         0.0           6.0    6.0      100.00
..       ...         ...           ...    ...         ...
810      Zoe         1.0           7.0    8.0       87.50
811     Zola         0.0           1.0    1.0      100.00
812     Zona         0.0           2.0    2.0      100.00
813     Zora         2.0           1.0    3.0       33.33
814     Zula         2.0           4.0    6.0       66.67

[815 rows x 5 columns]

In [51]:
grouped_unstack.sort_values(by='proportion',ascending=False,inplace=True)

In [52]:
grouped_unstack.head(10)

      manager  in_company  left_company  total  proportion
407    Jettie         0.0           2.0    2.0       100.0
101     Betty         0.0           7.0    7.0       100.0
730     Sadie         0.0           3.0    3.0       100.0
99      Betsy         0.0           6.0    6.0       100.0
724    Rosina         0.0           1.0    1.0       100.0
725    Rowena         0.0           1.0    1.0       100.0
100    Bettie         0.0           4.0    4.0       100.0
133     Celia         0.0           2.0    2.0       100.0
131  Celestia         0.0           1.0    1.0       100.0
59      Anner         0.0           2.0    2.0       100.0

In [53]:
data_deduplicated.groupby(['manager'])['still_in_company'].value_counts()

manager  still_in_company
Abbie    1                   6
         0                   3
Abby     0                   3
         1                   2
Abigail  1                   2
                            ..
Zona     1                   2
Zora     0                   2
         1                   1
Zula     1                   4
         0                   2
Name: still_in_company, Length: 1218, dtype: int64

In [55]:
data_deduplicated.groupby(['manager','still_in_company'])['still_in_company'].count()

manager  still_in_company
Abbie    0                   3
         1                   6
Abby     0                   3
         1                   2
Abigail  1                   2
                            ..
Zona     1                   2
Zora     0                   2
         1                   1
Zula     0                   2
         1                   4
Name: still_in_company, Length: 1218, dtype: int64